Documents/ВозвратТоваровОтКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВозвратТоваровОтКлиента</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.алкАкцизПоПриобретеннымЦенностям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/алкАкцизПоПриобретеннымЦенностям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>алкАкцизПоПриобретеннымЦенностям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщееКоличествоПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СостояниеСырья</Name>
					<Type>
						<v8:Type>cfg:EnumRef.алкСостоянияПодакцизногоСырья</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатусАкциза</Name>
					<Type>
						<v8:Type>cfg:EnumRef.алкСостоянияОплатыВходящегоАкциза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КБК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.алкКодыБюджетнойКлассификации2005</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВозвратТоваровОтКлиента/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура КГМ_ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр КГМ_Прослеживаемость
	Движения.алкАкцизПоПриобретеннымЦенностям.Записывать = Истина;
	
	//Если СокрЛП(Год(Дата))="2 021" Тогда 
	//	Коэф=0.031;  
	//Иначе 
		Коэф =0.032; 
	//КонецЕсли;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл   
		
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры=Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Готовая алкогольная продукция") Тогда
		
		// Расход ====================================================================================================================
		Движение = Движения.алкАкцизПоПриобретеннымЦенностям.Добавить();  
		
		Движение.Активность=Истина;
		Движение.Период			= Дата; 
		Движение.Организация	= Организация; 
		Движение.ДоговорКонтрагента=Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию("Договор поставки №115 от 22.09.2021 г. на поставку винограда");
		Движение.Сделка=Документы.ПриобретениеТоваровУслуг.НайтиПоРеквизиту("НомерВходящегоДокумента","0000-00810").Ссылка;   
			
		// Измерения 
		Движение.СерияНоменклатуры	= Справочники.СерииНоменклатуры.НайтиПоРеквизиту("Номер","00000414") ;    
		Движение.Номенклатура=Справочники.Номенклатура.НайтиПоНаименованию("Виноград в составе");  
		Движение.Продукция=ТекСтрокаТовары.Номенклатура;
		Движение.СерияПродукции=ТекСтрокаТовары.Серия;


		Движение.СостояниеСырья		= Перечисления.алкСостоянияПодакцизногоСырья.ВГотовойПродукции;
		Движение.СтатусАкциза		= Перечисления.алкСостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ;
		
		Движение.Количество		= (ТекСтрокаТовары.Количество*0.75)*1.34048257413; 
		Движение.КоличествоПродукции=ТекСтрокаТовары.Количество;  
		Движение.ОбщееКоличествоПродукции=ТекСтрокаТовары.Количество;
		
		//Движение.Стоимость		= 0;
		Движение.СуммаАкциза	= Коэф*(ТекСтрокаТовары.Количество*0.75)*1.34048257413;  
		Движение.КБК=Справочники.алкКодыБюджетнойКлассификации2005.НайтиПоКоду("18210302091011000110");
		Движение.СуммаПлатежа=20*(ТекСтрокаТовары.Количество*0.75)*1.34048257413;		

		
		КонецЕсли;
		
		// Реквизиты
	КонецЦикла;
	
КонецПроцедуры
